

&НаКлиенте
Процедура СортироватьПоДате(Команда)
	Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КаналПоступления");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = ПолучитьКаналПоступленияЛично();
	Отбор.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтбор(Команда)
	Для Каждого ЭлементОтбора из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КаналПоступления") Тогда
			ЭлементОтбора.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьКаналПоступленияЛично()
	Возврат Перечисления.КаналПоступления.Лично;
КонецФункции