

Процедура ОбработкаСохранения(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, Пользователь)
	ХранилищеДанныхФорм = Справочники.ХранилищеДанныхФорм.НайтиПоКоду(КлючНастроек).ПолучитьОбъект();
	ХранилищеДанныхФорм.ДанныеФормы = Новый ХранилищеЗначения(Настройки, Новый СжатиеДанных(9));
	ХранилищеДанныхФорм.Записать();
КонецПроцедуры

Процедура ОбработкаЗагрузки(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, Пользователь)
	ХранилищеДанныхФорм = Справочники.ХранилищеДанныхФорм.НайтиПоКоду(КлючНастроек);
	Настройки = ХранилищеДанныхФорм.ДанныеФормы.Получить();
КонецПроцедуры

