&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	Если НЕ Параметры.Ключ.Пустая() Тогда
		Если НЕ АнкетаЗаполнена Тогда
			ПараметрыФормы = Новый Структура("Документ",Объект.Ссылка );
			ОткрытьФорму("РегистрСведений.АнкетаОпросник.Форма.ФормаЗаписи",ПараметрыФормы,ЭтаФорма,,,,Новый ОписаниеОповещения("ПроверкаАнкеты",ЭтотОбъект),);
		Иначе
			ПараметрыФормы = Новый Структура("Документ",Объект.Ссылка );
			МассивКлюча = Новый Массив;
			МассивКлюча.Добавить(ПараметрыФормы);
			КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.АнкетаОпросник", МассивКлюча);
			СтруктураКлюча = Новый Структура;
			СтруктураКлюча.Вставить("Ключ", КлючЗаписи);
			ОткрытьФорму("РегистрСведений.АнкетаОпросник.Форма.ФормаЗаписи", СтруктураКлюча);
		КонецЕсли;
	Иначе
		Оповещение = Новый ОписаниеОповещения("ОтветНаВопрос",ЭтотОбъект);
		ТекстВопроса = "Перед продолжением нужно записать документ. Продолжить?";
		ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаАнкеты(ФейкПар1=Неопределено,ФейкПар2=Неопределено) Экспорт
	АнкетаЗаполнена = ПроверкаАнкетыНаСервере();
	Если АнкетаЗаполнена Тогда
		Элементы.СсылкаАнкета.Заголовок = "Просмотр и изменение анкеты";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаАнкетыНаСервере()
	Если Не Параметры.Ключ.Пустая() Тогда
		РС = РегистрыСведений.АнкетаОпросник.Выбрать(Новый Структура("Документ",Параметры.Ключ));
		Если РС.Следующий() Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОтветНаВопрос(Результат,ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьНаСервере();
		ПараметрыФормы = Новый Структура("Документ",Объект.Ссылка );
		ОткрытьФорму("РегистрСведений.АнкетаОпросник.Форма.ФормаЗаписи",ПараметрыФормы,ЭтаФорма,,,,Новый ОписаниеОповещения("ПроверкаАнкеты",ЭтотОбъект));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	ЭтотОбъект.Записать();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Параметры.Ключ.Пустая() Тогда
		ПроверкаАнкеты();
	КонецЕсли;
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура КаналПоступленияПриИзменении(Элемент)
	КаналПоступленияПриИзмененииНаСервере()	
КонецПроцедуры

&НаСервере
Процедура КаналПоступленияПриИзмененииНаСервере()
	Если Объект.КаналПоступления = Перечисления.КаналПоступления.Лично Тогда
		Если Объект.ДатаОбращения = Дата(1,1,1) Тогда
			Объект.ДатаОбращения = ТекущаяДата();
		КонецЕсли;
		Если Объект.ДатаРегистрации = Дата(1,1,1) Тогда
			Объект.ДатаРегистрации =    ТекущаяДата();
		КонецЕсли;
	ИначеЕсли Объект.КаналПоступления = Перечисления.КаналПоступления.ЧерезБанкПартнер  Тогда
		Если Объект.ДатаОбращения = Дата(1,1,1) Тогда
			Объект.ДатаОбращения = ТекущаяДата();
		КонецЕсли;
		Если Объект.ДатаРегистрации = Дата(1,1,1) Тогда
			Объект.ДатаРегистрации =    ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	УстановитьВидимость();	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
		Если Объект.КаналПоступления = Перечисления.КаналПоступления.Лично Тогда
			Элементы.ДатаПоступленияДокументовНаБумажномНосителе.Доступность = Ложь;
			Элементы.ДатаОбращения.Доступность = Ложь;
			Элементы.ДатаРегистрации.Доступность = Ложь;
		ИначеЕсли Объект.КаналПоступления = Перечисления.КаналПоступления.Почтой Тогда
			Элементы.ДатаПоступленияДокументовНаБумажномНосителе.Доступность = Ложь;
			Элементы.ДатаОбращения.Доступность = Истина;
			Элементы.ДатаРегистрации.Доступность = Истина;
		ИначеЕсли Объект.КаналПоступления = Перечисления.КаналПоступления.ЧерезБанкПартнер Тогда	
			Элементы.ДатаПоступленияДокументовНаБумажномНосителе.Доступность = Истина;
			Элементы.ДатаОбращения.Доступность = Ложь;
			Элементы.ДатаРегистрации.Доступность = Ложь;
		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.КаналПоступления= Перечисления.КаналПоступления.Лично;	
	КонецЕсли;
	КаналПоступленияПриИзмененииНаСервере();
КонецПроцедуры
