// процедура вставляет в структуру символы из строки по порядку с префиксом
//Например префикс "Фамилия" ИнфоСтрока Иванов, в структуре будут данные вида СтруктураДанных.Фамилия1 = "И",
//СтруктураДанных.Фамилия2 = "в", и т.д.
&НаКлиенте	
Процедура СтрокуДобавитьВСтруктуруПоСимволамНаКлиенте(СтруктураДанных, Префикс, ИнфоСтрока) Экспорт
	Для А = 1 По СтрДлина(ИнфоСтрока) Цикл
		СтруктураДанных.Вставить(Префикс + СтрЗаменить(Строка(А),Символы.НПП,""), Сред(ИнфоСтрока,А,1));
	КонецЦикла;
КонецПроцедуры

// BIV процедура заполняет переданный макет данными печати(структура)
//и выводит в табличный документ, если нужно вывести таблицу то в массив областей
//должна быть добавлена область "Строка" и в структуре данных должна быть таблица значений с ключом "ТЗ"
&НаСервере 
Процедура ВывестиДанныеВТабличныйДокумент(ТабДок, МассивОбластей, МакетПечати, ДанныеПечати) Экспорт
	Для Каждого ИмяОбласти Из МассивОбластей Цикл
		ОбластьМакета = МакетПечати.ПолучитьОбласть(ИмяОбласти);
		Если ИмяОбласти <> "Строка" Тогда
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
			ПроверкаВывода = ТабДок.ПроверитьВывод(ОбластьМакета);
			Если ПроверкаВывода Тогда
				ТабДок.Вывести(ОбластьМакета);
			Иначе
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДок.Вывести(ОбластьМакета);
			КонецЕсли;		
		Иначе
			Для Каждого СтрокаТаблицы Из ДанныеПечати.ТЗ Цикл
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				ПроверкаВывода = ТабДок.ПроверитьВывод(ОбластьМакета);
				Если ПроверкаВывода Тогда
					ТабДок.Вывести(ОбластьМакета);
				Иначе
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
					ТабДок.Вывести(ОбластьМакета);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

