&НаСервере
Функция ВернутьЧасовойПояс()
	Дата = ТекущаяДата();
	ЮТЦ = УниверсальноеВремя(Дата);
	GMT = (Дата - ЮТЦ)/3600;
	Если GMT >=0 Тогда
		Знак = "+";
	Иначе
		Знак = "-";
	КонецЕсли;
	МинутОтЧаса = Gmt - Цел(GMT);
	Часы = Цел(GMT);
	Если  МинутОтЧаса = 0 Тогда
		Окончание = ":00" ;
	Иначе
		Минуты = Цел(60 * МинутОтЧаса);
		Окончание = ":" + Строка(Минуты);
	КонецЕсли;
	Возврат Знак + Формат(Часы,"ЧЦ=2; ЧВН=")+ Окончание ;
КонецФункции


&наКлиенте 
Функция СлужебнаяИнформацияДатаВремя(ДатаДокумента) Экспорт
	Часовой = ВернутьЧасовойПояс();
	Дата=Формат(ДатаДокумента,"ДФ='yyyy-MM-dd""T""HH:mm:ss'" );
	Возврат Дата + Часовой;
КонецФункции