
Функция dogApiМетод(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ОтносительнаяЧастьURL",Запрос.ОтносительныйURL);
	СтруктураОтвета.Вставить("ПраметрЗапроса",Запрос.ПараметрыURL.Получить("ИмяМетода"));
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СоответствияОрганизацийПартнеровСрезПоследних.Период,
		|	СоответствияОрганизацийПартнеровСрезПоследних.Организация,
		|	СоответствияОрганизацийПартнеровСрезПоследних.Партнер,
		|	СоответствияОрганизацийПартнеровСрезПоследних.ПартнерИнформирования,
		|	СоответствияОрганизацийПартнеровСрезПоследних.ПартнерОбработки,
		|	СоответствияОрганизацийПартнеровСрезПоследних.Недействующий
		|ИЗ
		|	РегистрСведений.СоответствияОрганизацийПартнеров.СрезПоследних КАК СоответствияОрганизацийПартнеровСрезПоследних
		|ГДЕ
		|	СоответствияОрганизацийПартнеровСрезПоследних.Недействующий = Ложь";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Партнеры = Новый Массив();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Партнеры.Добавить(ВыборкаДетальныеЗаписи.Партнер.Наименование);
	КонецЦикла;
	СтруктураОтвета.Вставить("Партнеры",Партнеры);
	ПотокВПамяти = Новый ПотокВПамяти;
	ЗаписьJson = Новый ЗаписьJSON();
	ЗаписьJson.ОткрытьПоток(ПотокВПамяти, КодировкаТекста.UTF8, Ложь);
	ЗаписатьJSON(ЗаписьJson, СтруктураОтвета);
	ЗаписьJson.Закрыть();
	ДД = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();	
	Ответ.Заголовки.Вставить("Content-Type","application/json");
	Ответ.УстановитьТелоИзДвоичныхДанных(ДД);
	Возврат Ответ;
КонецФункции
