

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КлючОбъекта = Параметры.КлючОбъекта;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	КодСправочникаХранения = СоздатьЭлементСпрХранилищеДанныхФорм(КлючОбъекта, ИмяСохраняемойНастройки);
	Закрыть(Новый ВыборНастроек(КодСправочникаХранения));
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьЭлементСпрХранилищеДанныхФорм(КлючОбъекта, ИмяСохраняемойНастройки)
	СпрХран = Справочники.ХранилищеДанныхФорм.СоздатьЭлемент();
	СпрХран.Наименование = ИмяСохраняемойНастройки;
	СпрХран.КлючОбъекта = КлючОбъекта;
	СпрХран.Записать();
	Возврат СпрХран.Код;
КонецФункции