#Область ВспомогательныеФункции	

// формирует на сервере разницу между  
//универсальным временем и временем базы, и возвращает в ввиде "+03:00"
&НаСервере
Функция ВернутьЧасовойПоясGMT() Экспорт
	Дата = ТекущаяДата();
	ЮТЦ = УниверсальноеВремя(Дата);
	GMT = (Дата - ЮТЦ)/3600;
	Если GMT >=0 Тогда
		Знак = "+";
	Иначе
		Знак = "-";
	КонецЕсли;
	Часы = Цел(GMT);
	МинутОтЧаса = Gmt - Часы;
	Если  МинутОтЧаса = 0 Тогда
		Окончание = ":00" ;
	Иначе
		Минуты = Цел(60 * МинутОтЧаса);
		Окончание = ":" + Строка(Минуты);
	КонецЕсли;
	Возврат Знак + Формат(Часы,"ЧЦ=2; ЧВН=")+ Окончание ;
КонецФункции
#КонецОбласти