
&НаКлиенте
Процедура ГражданствоПриИзменении(Элемент)
	Если СтрДлина(Объект.Гражданство) <> 7 Тогда
		 Сообщить("Длина не соответствует формату");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	Если НЕ Параметры.Ключ.Пустая() Тогда
		Если НЕ АнкетаЗаполнена Тогда
			ПараметрыФормы = Новый Структура("Документ",Объект.Ссылка );
			ОткрытьФорму("РегистрСведений.АнкетаОпросник.Форма.ФормаЗаписи",ПараметрыФормы,ЭтаФорма,,,,Новый ОписаниеОповещения("ПроверкаАнкеты",ЭтотОбъект),);
		Иначе
			ПараметрыФормы = Новый Структура("Документ",Объект.Ссылка );
			МассивКлюча = Новый Массив;
			МассивКлюча.Добавить(ПараметрыФормы);
			КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.АнкетаОпросник", МассивКлюча);
			СтруктураКлюча = Новый Структура;
			СтруктураКлюча.Вставить("Ключ", КлючЗаписи);
			ОткрытьФорму("РегистрСведений.АнкетаОпросник.Форма.ФормаЗаписи", СтруктураКлюча);
		КонецЕсли;
	Иначе
		Оповещение = Новый ОписаниеОповещения("ОтветНаВопрос",ЭтотОбъект);
		ТекстВопроса = "Перед продолжением нужно записать документ. Продолжить?";
		ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Параметры.Ключ.Пустая() Тогда
		ПроверкаАнкеты();
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПроверкаАнкеты(ФейкПар1=Неопределено,ФейкПар2=Неопределено) Экспорт
	АнкетаЗаполнена = ПроверкаАнкетыНаСервере();
	Если АнкетаЗаполнена Тогда
		Элементы.ВводАнкеты.Заголовок = "Просмотр и изменение анкеты";
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция ПроверкаАнкетыНаСервере()
	Если Не Параметры.Ключ.Пустая() Тогда
		РС = РегистрыСведений.АнкетаОпросник.Выбрать(Новый Структура("Документ",Параметры.Ключ));
		Если РС.Следующий() Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
КонецФункции
&НаКлиенте
Процедура ОтветНаВопрос(Результат,ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьНаСервере();
		ПараметрыФормы = Новый Структура("Документ",Объект.Ссылка );
		ОткрытьФорму("РегистрСведений.АнкетаОпросник.Форма.ФормаЗаписи",ПараметрыФормы,ЭтаФорма,,,,Новый ОписаниеОповещения("ПроверкаАнкеты",ЭтотОбъект));
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ЗаписатьНаСервере()
	ЭтотОбъект.Записать();	
КонецПроцедуры
